Repository: Notausstieg0309/MoneyWatch
Catalog: src/moneywatch/translations/*/LC_MESSAGES/messages.po
Languages: de

source: Name is required.
de: Name ist notwendig.

source: IBAN is required.
de: IBAN ist notwendig

source: The provided IBAN is not valid
de: Die eingegebene IBAN ist nicht gültig.

source: The provided balance is not a valid numeric value.
de: Der eingegebene Kontostand ist kein gültiger numerischer Wert.

source: An account with the same name or IBAN already exists.
de: Ein Konto mit dem gleichen Namen oder der gleichen IBAN existiert bereits.

source: An account with the same name already exists.
de: Ein Konto mit dem gleichen Namen existiert bereits.

source: yyyy-MM-dd
de: dd.MM.yyyy

source: The budget must be given as numeric value.
de: Das Budget muss als numerischer Wert angegeben werden.

source: The name '%(name)s' already exists on this level
de: Der Name '%(name)s' existiert bereits auf dieser Ebene.

source: No file uploaded
de: Keine Datei hochgeladen

source: Import plugin file "%(name)s"
de: Import Plugin-Datei "%(name)s"

source: The file contains transactions that cannot be clearly assigned to an account based on the IBAN. Since only one account is currently created, these transactions were automatically assigned to the account "%(account_name)s". In case this is wrong, please create an appropriate account first and then assign the transactions manually to the new account during import.
de: Die Datei enthält Transaktionen die nicht eindeutig einem Konto basierend auf der IBAN zugeordnet werden können. Da aktuell nur ein einziges Konto angelegt ist, wurden alle Transaktionen automatisch dem Konto "%(account_name)s" zugeordnet. Sollte dies nicht korrekt sein, bitte zuerst das neue Konto anlegen und anschließend die Transaktionen im Rahmen des Import-Vorgangs manuell dem neuen Konto zuordnen.

source: Unable to create new rules. No categories are available to create rules for. Please create categories first.
de: Es können keine neuen Regeln angelegt werden. Es sind keine Kategorien vorhanden für die Regeln angelegt werden können. Bitte zuerst Kategorien anlegen.

source: Rule name is required.
de: Regel-Name ist notwendig.

source: Search pattern is required.
de: Suchausdruck ist notwendig.

source: Category is required.
de: Kategorie ist notwendig.

source: Invalid search pattern. The given search pattern is not a valid regular expression
de: Ungültiger Suchausdruck. Der angegebene Suchausdruck ist kein gültiger regulärer Ausdruck (Regex).

source: Entered pattern does not matched the selected transaction you want to create this rule for.
de: Der eingegebene Such-Ausdruck passt nicht zu der ausgewählten Transaktion für die diese Regel erstellt werden soll.

source: A rule with the same name already exists.
de: Eine Regel mit demselben Namen existiert bereits.

source: The transaction '%(description)s' cannot be edited anymore.
de: Die Transaktion %(description)s kann nicht mehr bearbeitet werden.

source: Transactions
de: Transaktionen

source: Import New Transactions
de: Neue Transaktionen importieren

source: Analysis
de: Analyse

source: Import Ruleset
de: Import-Regeln

source: Categories
de: Kategorien

source: Overview
de: Übersicht

source: New Account
de: Neues Konto

source: Account Name
de: Konto Name

source: Initial Balance
de: Aktueller Kontostand

source: No Color
de: Keine Farbe

source: Save
de: Speichern

source: Edit Account
de: Konto bearbeiten

source: Parameters
de: Parameter

source: Chart
de: Grafik

source: Table
de: Tabelle

source: Selection Parameters
de: Abfrage Parameter

source: What do you want to see?
de: Was soll angezeigt werden?

source: Account Balance (end of interval)
de: Kontostand (am Ende vom Interval)

source: Net Change
de: Gewinn / Verlust

source: Deposits
de: Einnahmen

source: Overall
de: Gesamt

source: By Rule
de: nach Import-Regel

source: By Category
de: nach Kategorie

source: Withdrawals
de: Ausgaben

source: For which account?
de: Für welches Konto?

source: Please select...
de: Bitte auswählen...

source: [All Accounts]
de: [alle Konten]

source: Account
de: Konto

source: Rule
de: Import-Regel

source: Category
de: Kategorie

source: Timing?
de: Zeitraum?

source: From
de: Von

source: To
de: Bis

source: Grouping
de: Gruppierung

source: monthly
de: monatlich

source: quarterly
de: quartalsweise

source: semi-annual
de: halbjährlich

source: annual
de: jährlich

source: Submit
de: Abfragen

source: total
de: Gesamt

source: New Category
de: Neue Kategorie

source: Category Name
de: Kategoriename

source: below of
de: unterhalb von

source: Monthly Budget
de: monatliches Budget

source: Edit Category
de: Kategorie ändern

source: none
de: keine

source: Superior Category
de: übergeordnete Kategorie

source: mthly. budget: %(budget)s
de: mtl. Budget: %(budget)s

source: Add new subcategory
de: Neue Unterkategorie

source: Edit this category
de: Diese Kategorie ändern

source: Delete this category
de: Diese Kategorie löschen

source: No categories for Deposits exist.
de: Es existieren keine Kategorien für Einnahmen.

source: New Main Category
de: Neue Hauptkategorie

source: Check imported transactions
de: Überprüfe Transaktionen

source: Please check the missing input for the following highlighted transactions.
de: Bitte die folgenden hervorgehobenen Transaktionen auf fehlende Eingaben überprüfen.

source: No transactions found.
de: Keine Transaktionen verfügbar.

source: Import Transactions
de: Transaktionen importieren

source: File to import
de: Datei zum importieren

source: allowed file extensions
de: erlaubte Dateiformate

source: Choose File
de: Datei auswählen

source: Load
de: Laden

source: Check again
de: Erneut überprüfen

source: The following transaction matches multiple rules. This problem can occur when rules uses a search pattern that is not specific enough for such edge cases. If this problem happens several times with the same rules involved please consider to precise the search pattern of these rules.
de: Die folgende Transaktion passt zu mehreren Import-Regeln. Dieses Problem kann auftreten, wenn verschiedene Import-Regeln einen Suchausdruck verwenden, der nicht spezifisch genug in solchen Fällen ist. Wenn dieses Problem mit der selben Regel wiederholt auftritt, sollte man den Suchausdruck basierend auf den bereits vorhandenen Transaktionen versuchen zu präzisieren.

source: Please decide which rule this transaction applies to.
de: Bitte die passende Import-Regel für die folgende Transaktion auswählen.

source: Matching Rule
de: Korrekte Import-Regel

source: Please Choose
de: Bitte auswählen

source: None
de: Keine

source: The file contains %(num)s transaction which cannot be assigned to the correct account automatically.
de: Die zu importierende Datei enthält %(num)s Transaktion, welche nicht automatisch einem Konto zugeordnet werden kann.

source: Please decide for which account these transactions should be imported.
de: Bitte wählen, für welches Konto diese Transaktionen importiert werden sollen.

source: The uploaded file contains transactions for the following unknown account IBAN.
de: Die hochgeladene Datei enthält Transaktionen für die folgende aktuell unbekannte IBAN.

source: Do you want to create a new account for this IBAN?
de: Möchten Sie ein zusätzliches Konto für diese IBAN anlegen?

source: No
de: Nein

source: Yes
de: Ja

source: today
de: heute

source: yesterday
de: gestern

source: edit
de: Bearbeiten

source: delete
de: Löschen

source: Copy IBAN to clipboard
de: Kopiere IBAN in die Zwischenablage

source: last transaction
de: letzte Transaktion

source: There are no accounts defined yet. Please click below on the add button to create a new account.
de: Aktuell sind keine Konten definiert. Klick unten auf den Hinzufügen-Button um ein neues Konto anzulegen.

source: Add a new account
de: Ein neues Konto anlegen

source: yyyy/MM
de: MM.yyyy

source: Months
de: Monate

source: MM-dd
de: dd.MM

source: Planned transaction is overdue.
de: Diese geplante Transaktion ist überfällig.

source: Show historical graph
de: Historischen Verlauf anzeigen

source: Edit transaction
de: Transaktion bearbeiten

source: This category contains overdue planned transactions.
de: Diese Kategorie enthält geplante Transaktionen die bereits überfällig sind.

source: The overall amount of pending regular transactions in or underneath this category.
de: Der ausstehende Betrag aller noch offenen regelmäßigen Transaktionen in oder unterhalb dieser Kategorie.

source: pending
de: ausstehend

source: All regular transactions for this category are already done.
de: Alle regelmäßigen Transaktionen für diese Kategorie sind bereits durchgeführt.

source: The current consumption of the planned budget of %(budget)s.
de: Der aktuelle Verbrauch des geplanten Budgets von %(budget)s.

source: No transactions available
de: Keine Transaktionen verfügbar

source: previous month
de: vorheriger Monat

source: current month in %(year)s
de: aktueller Monat in %(year)s

source: previous year
de: vorheriges Jahr

source: previous timeperiod
de: vorheriger Zeitraum

source: Planned
de: Geplant

source: Current
de: Aktuell

source: current values incl. pending regular transactions
de: aktuellen Zahlen inkl. noch ausstehenden Transaktionen

source: next month
de: nächster Monat

source: next year
de: nächstes Jahr

source: next timeperiod
de: nächster Zeitraum

source: This month contains %(num)d message. Click here to show them.
de: Dieser Monat enthält %(num)d Nachricht. Hier klicken um diese anzuzeigen.

source: This timeframe contains %(num)d message. Click here to show them.
de: Dieser Zeitraum enthält %(num)d Nachricht. Hier klicken um diese anzuzeigen.

source: particular transactions:
de: Besondere Transaktionen:

source: New rule
de: Neue Regel

source: deposits
de: Einnahmen

source: withdrawals
de: Ausgaben

source: The unique name of the rule. This value will also used as the description of newly found transactions if no short description is configured explicitly for this rule.
de: Der eindeutige Name der Regel. Dieser Wert wird auch als Buchungsbezeichnung für neu gefundene Transaktionen verwendet, wenn für diese Regel keine Buchungsbezeichnung explizit konfiguriert ist.

source: Rule Name
de: Regelname

source: The search pattern (phython based regular expression) used to identify matching transactions during import based on their booking text.
de: Der Such-Ausdruck (Python-basierter regulärer Ausdruck), welcher zu importierende Transaktionen anhand des Buchungstextes erkennt und entsprechend zuordnet.

source: Search Pattern
de: Suchausdruck

source: The short description that will be used for all matched transactions during import. The short description still can be changed during import.
de: Die Kurzbeschreibung, welche für alle erkannten Transaktionen im Rahmend es Importvorgangs benutzt werden. Die Kurzbeschreibung kann im Rahmen des Imports dennoch geändert werden.

source: Short Description
de: Buchungsbezeichnung

source: no regularity
de: keine Regelmäßigkeit

source: Regularity
de: Regelmäßigkeit

source: Next Due
de: Nächste Fälligkeit

source: Amount
de: Betrag

source: Check also all historical transactions for a successful match
de: Bereits vorhandene Transaktionen zuweisen

source: Check
de: Überprüfen

source: Change Rule
de: Ändere Regel

source: Assign
de: Zuweisen

source: No matching transactions found.
de: Keine passenden Transaktionen gefunden

source: Matched Transactions
de: Gefundene Transaktionen

source: This is a rule identifying regular transactions
de: Diese Regel identifiziert regelmäßige Transaktionen.

source: Match Pattern
de: Suchausdruck

source: change this rule
de: Diese Regel ändern

source: delete this rule
de: Diese Regel löschen

source: No rules exist yet.
de: Es existieren aktuell keine Regeln.

source: Rules for deposits
de: Regeln für Einnahmen

source: Add rule
de: Neue Regel

source: Rules for withdrawals
de: Regeln für Ausgaben

source: Edit Transaction
de: Transaktion bearbeiten

source: This transaction was identified by a rule. You can clear the binding of this transaction to the matched rule in case this transaction was mistakenly matched. In this case you should adapt the search pattern of the corresponding rule.
de: Diese Transaktion wurde durch eine Import-Regel identifiziert. Die Verbindung zu dieser Import-Regel kann aufgehoben werden, falls die Transaktion fälschlicherweise durch diese Regel erkannt wurde. In diesem Fall sollte der Suchausdruck dieser Regel angepasst werden.

source: Clear rule binding (%(rulename)s)
de: Regelverknüpfung aufheben (%(rulename)s)

source: search for transactions...
de: Suche nach Transaktionen...

source: No transactions available.
de: Keine Transaktionen verfügbar.

source: Please enter a description
de: Bitte eine Beschreibung eingeben

source: I have noted this message
de: Zur Kenntnis genommen

source: Create an import rule based on this transaction
de: Erstelle eine Import-Regel basierend auf dieser Transaktion

source: Create Rule
de: Erstelle Regel

source: %(half_year)sH %(year)s
de: %(half_year)s. Hj. %(year)s

source: The plugin %s has no parse_function implemented or registered
de: Das Plugin %s hat keine parse_function implementiert oder registriert.
